# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_dashboard_grafana.grafana has been deleted
  - resource "azurerm_dashboard_grafana" "grafana" {
      - id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Dashboard/grafana/altinn-grafana-test" -> null
        name                                   = "altinn-grafana-test"
        tags                                   = {}
        # (12 unchanged attributes hidden)

      - identity {
          - principal_id = "802faf1f-1073-4d8a-859b-7d1f403f5158" -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_workspace.altinn_monitor has been deleted
  - resource "azurerm_monitor_workspace" "altinn_monitor" {
      - default_data_collection_endpoint_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_altinn-monitor-test-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/altinn-monitor-test-amw" -> null
      - id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Monitor/accounts/altinn-monitor-test-amw" -> null
        name                                = "altinn-monitor-test-amw"
        tags                                = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "altinn-grafana-test"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "altinn-monitor-test-rg"
      + sku                                    = "Standard"
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_monitor_workspace.altinn_monitor will be created
  + resource "azurerm_monitor_workspace" "altinn_monitor" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "altinn-monitor-test-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "altinn-monitor-test-rg"
    }

  # azurerm_role_assignment.altinn_apps_terraform_ma_rg["Contributor"] will be created
  + resource "azurerm_role_assignment" "altinn_apps_terraform_ma_rg" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26e1eede-69a5-46b2-abea-f839092273ba"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.altinn_apps_terraform_ma_rg["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "altinn_apps_terraform_ma_rg" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26e1eede-69a5-46b2-abea-f839092273ba"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.grafana_admin["143ed28a-6e6d-4ca0-8273-eecb9c1665ba"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "143ed28a-6e6d-4ca0-8273-eecb9c1665ba"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.grafana_admin["5a5ed585-9f7c-4b94-80af-9ceee8124db3"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5a5ed585-9f7c-4b94-80af-9ceee8124db3"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.monitoring_reader_rg must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg" {
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Authorization/roleAssignments/19ae3296-a460-0073-f4a2-42edb5a55d68" -> (known after apply)
      ~ name                                   = "19ae3296-a460-0073-f4a2-42edb5a55d68" -> (known after apply)
      ~ principal_id                           = "802faf1f-1073-4d8a-859b-7d1f403f5158" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply) # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.platform_terraform_ma_rg["Contributor"] will be created
  + resource "azurerm_role_assignment" "platform_terraform_ma_rg" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "641fc568-3e2f-4174-a7ce-d91f50c8e6d6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.platform_terraform_ma_rg["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "platform_terraform_ma_rg" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "641fc568-3e2f-4174-a7ce-d91f50c8e6d6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.tf_grafana_admin will be created
  + resource "azurerm_role_assignment" "tf_grafana_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02b17d28-7ec8-4084-92ce-d26051fa4998"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

Plan: 10 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `workflow_dispatch` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`